In [1]:
import pandas as pd

In [2]:
data = pd.read_json('dados_vendas_clientes.json')
data

                                        dados_vendas
0  {'Data de venda': '06/06/2022', 'Cliente': ['@...
1  {'Data de venda': '07/06/2022', 'Cliente': ['I...
2  {'Data de venda': '08/06/2022', 'Cliente': ['I...
3  {'Data de venda': '09/06/2022', 'Cliente': ['J...
4  {'Data de venda': '10/06/2022', 'Cliente': ['M...

In [3]:
data = pd.json_normalize(data['dados_vendas'])
data

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [4]:
columns = list(data.columns)[1:]
columns

['Cliente', 'Valor da compra']

In [5]:
data = data.explode(columns)
data

  Data de venda             Cliente Valor da compra
0    06/06/2022     @ANA _LUCIA 321        R$ 836,5
0    06/06/2022  DieGO ARMANDIU 210       R$ 573,33
0    06/06/2022  DieGO ARMANDIU 210        R$ 392,8
0    06/06/2022  DieGO ARMANDIU 210       R$ 512,34
1    07/06/2022  Isabely JOanes 738       R$ 825,31
1    07/06/2022  Isabely JOanes 738       R$ 168,07
1    07/06/2022  Isabely JOanes 738       R$ 339,18
1    07/06/2022  Isabely JOanes 738       R$ 314,69
2    08/06/2022  Isabely JOanes 738       R$ 682,05
2    08/06/2022    JOãO Gabriel 671       R$ 386,34
2    08/06/2022  Julya meireles 914       R$ 622,65
2    08/06/2022  Julya meireles 914       R$ 630,79
3    09/06/2022  Julya meireles 914        R$ 390,3
3    09/06/2022     MaRIA Julia 444       R$ 759,16
3    09/06/2022     MaRIA Julia 444       R$ 334,47
3    09/06/2022     MaRIA Julia 444       R$ 678,78
4    10/06/2022     MaRIA Julia 444       R$ 314,24
4    10/06/2022     PEDRO PASCO 812       R$ 311,15
4    10/06/2022    Paulo castro 481       R$ 899,16
4    10/06/2022   Thiago fritzz 883       R$ 885,24

In [6]:
data.reset_index(drop=True, inplace=True)
data

   Data de venda             Cliente Valor da compra
0     06/06/2022     @ANA _LUCIA 321        R$ 836,5
1     06/06/2022  DieGO ARMANDIU 210       R$ 573,33
2     06/06/2022  DieGO ARMANDIU 210        R$ 392,8
3     06/06/2022  DieGO ARMANDIU 210       R$ 512,34
4     07/06/2022  Isabely JOanes 738       R$ 825,31
5     07/06/2022  Isabely JOanes 738       R$ 168,07
6     07/06/2022  Isabely JOanes 738       R$ 339,18
7     07/06/2022  Isabely JOanes 738       R$ 314,69
8     08/06/2022  Isabely JOanes 738       R$ 682,05
9     08/06/2022    JOãO Gabriel 671       R$ 386,34
10    08/06/2022  Julya meireles 914       R$ 622,65
11    08/06/2022  Julya meireles 914       R$ 630,79
12    09/06/2022  Julya meireles 914        R$ 390,3
13    09/06/2022     MaRIA Julia 444       R$ 759,16
14    09/06/2022     MaRIA Julia 444       R$ 334,47
15    09/06/2022     MaRIA Julia 444       R$ 678,78
16    10/06/2022     MaRIA Julia 444       R$ 314,24
17    10/06/2022     PEDRO PASCO 812       R$ 311,15
18    10/06/2022    Paulo castro 481       R$ 899,16
19    10/06/2022   Thiago fritzz 883       R$ 885,24

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     object
dtypes: object(3)
memory usage: 612.0+ bytes

In [8]:
import numpy as np

data['Valor da compra'] = data['Valor da compra'].apply(lambda x: x.replace('R$', '').replace(',', '.').strip())
data['Valor da compra'] = data['Valor da compra'].astype(np.float64)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 612.0+ bytes

In [9]:
data['Cliente']

0        @ANA _LUCIA 321
1     DieGO ARMANDIU 210
2     DieGO ARMANDIU 210
3     DieGO ARMANDIU 210
4     Isabely JOanes 738
5     Isabely JOanes 738
6     Isabely JOanes 738
7     Isabely JOanes 738
8     Isabely JOanes 738
9       JOãO Gabriel 671
10    Julya meireles 914
11    Julya meireles 914
12    Julya meireles 914
13       MaRIA Julia 444
14       MaRIA Julia 444
15       MaRIA Julia 444
16       MaRIA Julia 444
17       PEDRO PASCO 812
18      Paulo castro 481
19     Thiago fritzz 883
Name: Cliente, dtype: object

In [10]:
data['Cliente'] = data['Cliente'].str.replace('[^a-zA-Z\u00C0-\u00FF| ]', '', regex=True)
data.head()

  Data de venda          Cliente  Valor da compra
0    06/06/2022       ANA LUCIA            836.50
1    06/06/2022  DieGO ARMANDIU            573.33
2    06/06/2022  DieGO ARMANDIU            392.80
3    06/06/2022  DieGO ARMANDIU            512.34
4    07/06/2022  Isabely JOanes            825.31

In [11]:
data['Cliente'] = data['Cliente'].str.lower()
data.head()

  Data de venda          Cliente  Valor da compra
0    06/06/2022       ana lucia            836.50
1    06/06/2022  diego armandiu            573.33
2    06/06/2022  diego armandiu            392.80
3    06/06/2022  diego armandiu            512.34
4    07/06/2022  isabely joanes            825.31

In [12]:
data['Data de venda'] = pd.to_datetime(data['Data de venda'], format='%d/%m/%Y')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     datetime64[ns]
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 612.0+ bytes

In [44]:
df_client_value = data.groupby(data['Cliente'])[['Valor da compra']].max()
df_client_value

                 Valor da compra
Cliente
ana lucia                 836.50
diego armandiu            573.33
isabely joanes            825.31
joão gabriel              386.34
julya meireles            630.79
maria julia               759.16
paulo castro              899.16
pedro pasco               311.15
thiago fritzz             885.24

In [50]:
df_client_value.loc[df_client_value['Valor da compra'].idxmax()]

Valor da compra    899.16
Name: paulo castro , dtype: float64